---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CurtainSystemCouldnotReacquireFaces
source: html/d90e38ec-13f1-8a3e-e161-7235bf4d0ea0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures.CurtainSystemCouldnotReacquireFaces Property

Curtain System could not reacquire [Number] faces out of [Number].

## Syntax (C#)
```csharp
public static FailureDefinitionId CurtainSystemCouldnotReacquireFaces { get; }
```